ims/feature-service/limit-service-1/limit-service.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="limit-service" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="ssl" elementType="Argument">
            <stringProp name="Argument.name">ssl</stringProp>
            <stringProp name="Argument.value">${__P(serviceSsl)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="server" elementType="Argument">
            <stringProp name="Argument.name">server</stringProp>
            <stringProp name="Argument.value">${__P(serviceIp)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="port" elementType="Argument">
            <stringProp name="Argument.name">port</stringProp>
            <stringProp name="Argument.value">${__P(servicePort)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="jwt" elementType="Argument">
            <stringProp name="Argument.name">jwt</stringProp>
            <stringProp name="Argument.value">Bearer eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIxMzAwMSIsImRldmljZV9pZCI6IkludGVybmFsIiwiaXNzIjoiZWRnZSIsInR5cGUiOiJFbXBsb3llZSIsImJyYW5jaCI6IjUwMDYiLCJhdWQiOlsiYWNjb3VudC1zZXJ2aWNlLTEiLCJlYmlsbGluZy1zZXJ2aWNlIiwidHJhbnNmZXItc2VydmljZS0xIiwiY3VzdG9tZXJzLXNlcnZpY2UtMSIsInJhdGUtc2VydmljZS0xIiwiY2F0YWxvZy1zZXJ2aWNlLTEiLCJzdGF0ZW1lbnQtc2VydmljZS0xIiwiZG9jdW1lbnQtc2VydmljZS0xIiwiaWRlbnRpdHktc2VydmljZS0xIiwieHlwLXNlcnZpY2UtMSIsImNhcmQtc3RhdGVtZW50LXNlcnZpY2UtMSIsInRva2VuaXphdGlvbi1zZXJ2aWNlLTEiLCJ0YXgtc2VydmljZS0xIiwidGFza3Mtc2VydmljZS0xIiwiY2FzaGluZy1zZXJ2aWNlLTEiLCJsb2FuLXNlcnZpY2UtMiIsInh5cC1zZXJ2aWNlLTEiLCJjYXJkcy1zZXJ2aWNlLTEiLCJwYXltZW50LXNlcnZpY2UtMSIsImNnYS1zZXJ2aWNlLTEiLCJtaWstc2VydmljZS0xIiwibWluaWNybS1zZXJ2aWNlLTEiLCJrcGktc2VydmljZS0xIiwiYWxsb3dhbmNlLXNlcnZpY2UiLCJmb3JleC1zZXJ2aWNlLTEiLCJ1c2EtdmlzYS1mZWUtc2VydmljZS0xIiwibm9zdHJvLXNlcnZpY2UtMSIsImNhcmQtaW1zLXNlcnZpY2UtMSIsImNhcmQtY29udHJvbGxlci1zZXJ2aWNlLTEiLCJ0ZW5kZXItc2VydmljZS0xIiwibGVnYWwtc2VydmljZS0xIiwiZmVlLXNlcnZpY2UtMiIsImdvbGQtc2VydmljZS0xIiwidHJhbnNmZXItaW50ZXJuYWwtc2VydmljZS0xIiwiZGlzcGl0Y2hlci1zZXJ2aWNlLTEiLCJ0ZWxsZXItc2VydmljZS0xIiwicGxlZGdlcmVnaXN0ZXItc2VydmljZS0xIiwiYnVsay10cmFuc2FjdGlvbi1zZXJ2aWNlLTEiLCJvcmdhbml6YXRpb24tc2VydmljZS0xIiwiYmVoYXZpb3JhbC1zZXJ2aWNlLTEiLCJzbXMtYmFuay1zZXJ2aWNlLTEiLCJjb3Jwb3JhdGVwb3J0YWwtc2VydmljZS0xIiwiY3JlZGl0LXN0YXRlbWVudC1zZXJ2aWNlLTEiLCJmZWUtc2VydmljZS0xIiwia2hhbmJhbmstcW1zLTEiLCJxbXMtY29yZS1zZXJ2aWNlLTEiLCJxbXMtcmVwb3J0LXNlcnZpY2UtMSIsInJlcXVlc3Qtc2VydmljZS0xIiwicmVwb3J0LXNlcnZpY2UtMiIsImNlbnRyYWwtYWRkcmVzcy1zZXJ2aWNlLTEiLCJjb25zdW1lci1sb2FuLXNlcnZpY2UtMSIsInNtc2JhbmstcmVnaXN0ZXItc2VydmljZS0xIiwibGltaXQtc2VydmljZS0xIl0sImRldmljZV9uYW1lIjoiTW96aWxsYS81LjAgKFdpbmRvd3MgTlQgMTAuMDsgV2luNjQ7IHg2NCkgQXBwbGVXZWJLaXQvNTM3LjM2IChLSFRNTCwgbGlrZSBHZWNrbykgQ2hyb21lLzgwLjAuMzk4Ny4xMjIgU2FmYXJpLzUzNy4zNiIsImRldmljZV9hZGRyZXNzIjoiMTAuNi4yMTAuMTQiLCJleHAiOjI1OTIyOTExMDAsImxhbmciOiJtbi1NTiIsImlhdCI6MTU5MjI4OTMwMCwianRpIjoiOWZhZjI5ZTUtM2FjZC00YWFmLTgyZjAtZDBjN2MyODBjNDZhIn0.cHDzfB6NlXiYQgmH2TEETT4CYmg7a-hbgEc6_91w6KZNU5npEiZqAU2RN1bnblNR1SDP5rL9hccWV7w6kJEERA</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="content-type" elementType="Argument">
            <stringProp name="Argument.name">content-type</stringProp>
            <stringProp name="Argument.value">Application/JSON</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="threadUser" elementType="Argument">
            <stringProp name="Argument.name">threadUser</stringProp>
            <stringProp name="Argument.value">${__P(user,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="threadLoop" elementType="Argument">
            <stringProp name="Argument.name">threadLoop</stringProp>
            <stringProp name="Argument.value">${__P(loop,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${server}</stringProp>
        <stringProp name="HTTPSampler.port">${port}</stringProp>
        <stringProp name="HTTPSampler.protocol">${ssl}</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">${jwt}</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">content-type</stringProp>
            <stringProp name="Header.value">${content-type}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="service-endpoints" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${threadLoop}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${threadUser}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST | /limit/accept" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;account&quot;: &quot;5753803618&quot;,&#xd;
  &quot;accountCurrency&quot;: &quot;MNT&quot;,&#xd;
  &quot;amount&quot;: 1,&#xd;
  &quot;amountCurrency&quot;: &quot;MNT&quot;,&#xd;
  &quot;bancsDate&quot;: &quot;44028&quot;,&#xd;
  &quot;cif&quot;: &quot;95003223712&quot;,&#xd;
  &quot;loginName&quot;: &quot;string&quot;,&#xd;
  &quot;product&quot;: &quot;kiosk&quot;,&#xd;
  &quot;trace&quot;: &quot;1&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">limit/accept?type=transaction</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST | /limit/check" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;account&quot;: &quot;5753803618&quot;,&#xd;
  &quot;accountCurrency&quot;: &quot;MNT&quot;,&#xd;
  &quot;amount&quot;: 1,&#xd;
  &quot;amountCurrency&quot;: &quot;MNT&quot;,&#xd;
  &quot;bancsDate&quot;: &quot;44028&quot;,&#xd;
  &quot;cif&quot;: &quot;95003223712&quot;,&#xd;
  &quot;loginName&quot;: &quot;string&quot;,&#xd;
  &quot;product&quot;: &quot;kiosk&quot;,&#xd;
  &quot;trace&quot;: &quot;1&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">limit/check?type=transaction</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST | /limit/cancel" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;account&quot;: &quot;5753803618&quot;,&#xd;
  &quot;accountCurrency&quot;: &quot;MNT&quot;,&#xd;
  &quot;amount&quot;: 1,&#xd;
  &quot;amountCurrency&quot;: &quot;MNT&quot;,&#xd;
  &quot;bancsDate&quot;: &quot;44028&quot;,&#xd;
  &quot;cif&quot;: &quot;95003223712&quot;,&#xd;
  &quot;loginName&quot;: &quot;string&quot;,&#xd;
  &quot;product&quot;: &quot;kiosk&quot;,&#xd;
  &quot;trace&quot;: &quot;1&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">limit/cancel?type=transaction</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>